tvizninja/esp32s3-qr-msc/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# AtomS3 Lite has 8 MB SPI flash.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# QR Transfer requires the custom 8 MB partition layout in partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# USB Mass Storage Class is mandatory for QR Transfer.
# esp_tinyusb defaults MSC to disabled, and this project uses the component's
# default configuration descriptor (configuration_descriptor = NULL).
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=512
